app/Services/CartService.php

    public function getCartItems()
    {
        $cart = $this->getCart();
        if (!$cart) {
            return [];
        }

        $items = $this->itemModel->where('cart_id', $cart['id'])->findAll();

        if (empty($items)) {
            return [];
        }
        // Products
        $productIds = array_column($items, 'product_id');
        if (empty($productIds)) {
            return [];
        }

        $products = $this->productManageModel->whereIn('id', $productIds)->findAll();
        $products = array_column($products, null, 'id');

        // Categories
        $categoryIds = array_unique(array_column($products, 'category_id'));

        if (!empty($categoryIds)) {
            $categories = $this->categoryModel
                ->whereIn('id', $categoryIds)
                ->findAll();
---
SELECT *
FROM `cart_items`
WHERE `cart_id` = '223'
SELECT *
FROM `categories`
WHERE `id` IN ('1')

    public function shippingCharge()
    {

        $cart = $this->getCart();
        if (!$cart) {
            return ['status' => false, 'message' => 'Cart not found'];
        }
        $cartSession = $this->getCartSessionId();
        $shippingAddress = $this->shippingAddressModel->where(['session_id' => $cartSession,'is_default'=>1])->first();
---
SELECT *
FROM `shipping_addresses`
WHERE `session_id` = 'k1t93uu99ev926v0lqivck4lfqn42fih'
AND `is_default` = 1
 LIMIT 1

    public function shippingAddress(){
        $cartSession = $this->getCartSessionId();
        $shippingAddress = $this->shippingAddressModel->where(['session_id' => $cartSession,'is_default'=>1])->first();
---
SELECT *
FROM `shipping_addresses`
WHERE `session_id` = 'k1t93uu99ev926v0lqivck4lfqn42fih'
AND `is_default` = 1
 LIMIT 1