app/Services/CartService.php

SELECT *
FROM `carts`
WHERE `user_id` = '1'
 LIMIT 1
SELECT *
FROM `carts`
WHERE `session_id` = 'jn9rc7oqvtahpiqoq61b9mtormg1q91r'
 LIMIT 1
---
    private function getCart()
    {
        $session = session();

        $user = $session->get('user');
        $userId = 0;

        if ($user && isset($user['isLoggedIn']) && $user['isLoggedIn'] === true) {
            $userId = $user['userId']; // use 'id' not userId
        }

        $sessionId = $session->get('cart_session') ?? session_id();
        $session->set('cart_session', $sessionId);

        if ($userId) {
            $cart = $this->cartModel->where('user_id', $userId)->first();
            if ($cart) {
                return $cart;
            }
        }

        return $this->cartModel->where('session_id', $sessionId)->first();

SELECT *
FROM `carts`
WHERE `session_id` = 'nnut2eg7meiskfsqd1cvfgukrtjbt2le'
AND `user_id` = 0
 LIMIT 1
---
     private function createCart()
    {
        $session = session();
        $user = $session->get('user');
        $userId = 0;

        if ($user && isset($user['isLoggedIn']) && $user['isLoggedIn'] === true) {
            $userId = $user['userId']; // use 'id' not userId
        }
        return $this->cartModel->insert([
            'user_id'    => $userId,
            'session_id' => $session->get('cart_session'),
            'created_at' => date('Y-m-d H:i:s')
        ]);