app/Services/ShippingCharge.php

SELECT *
FROM `shipping_charge`
WHERE `state` = 'Kerala'
AND `is_active` = 1
 LIMIT 1
---
    public function old_calculate($cartTotal, $state)
    {
        $model = new ShippingchargeModel();

        // Normalize state
        $state = ucfirst(strtolower(trim($state)));

        //  Free shipping (optional)
        if ($cartTotal >= 10000) {
            return 0;
        }
        if($state) {
             //  1. Match exact state (Kerala)
            $rule = $model->where('state', $state)->where('is_active', 1)->first();

SELECT *
FROM `shipping_configration`
WHERE `product_id` IN ('4')
---
    public function calculate($cartTotal, $state)
    {
        $model = new ShippingchargeModel();
        $cartService = new CartService();
        $shippingAddress = $cartService->shippingAddress();
        $cartItems = $cartService->getCartItems();
        // product items id from cartItems
        $productIds = array_column($cartItems, 'product_id');
        $shippingInfo = $this->shippingconfigrationModel->whereIn('product_id',$productIds)->get()->getResultArray();
        $cod = 1;
        $cod = ($cod == 1) ? 1 : 0;



        // Create cart array indexed by product_id
        $cartData = [];
        foreach ($cartItems as $item) {
            $cartData[$item['product_id']] = $item;
        }

        $shippingInfo = $this->shippingconfigrationModel
            ->whereIn('product_id', $productIds)
            ->findAll();