app/Controllers/admin/CategoryController.php

    function index(){
        $page = (hasPermission('','category') ?  ucwords(getappdata('category')) : lang('Custom.permissionDenied'));
        $route = (hasPermission('','category') ? 'admin/category/category' :'admin/pages-error-404');
        $roles = $this->categoryModel->orderBy('level','ASC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `level` ASC

    function ajaxcategory() {
         if(!haspermission('','category')) {
            return $this->response->setJSON(['success' => false,'message' => 'Permission Denied']);
        }
        if(!$this->request->isAJAX()) {
            return $this->response->setJSON(['success' => false,'message' => ' Invalid Request']);
        }

        $category =  $this->categoryModel->where('is_active',1)->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1