app/Controllers/admin/productmanagementController.php

    public function index()
    {
       $page = (haspermission('','product_management')) ? ucwords(getappdata('product_management')) : lang('Custom.permissiondenied');
       $route = (haspermission('','product_management')) ? 'admin/productmanagement/index' : 'admin/pages-error-404';
       $categories = $this->categoryModel->where('is_active',1)->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1