app/Controllers/admin/SalesController.php

    public function index() {
        $page = (!hasPermission('','sales') ? lang('Custom.permissionDenied') :'Sales');
        $route = (!hasPermission('','sales') ?'pages-error-404' :'admin/sales/index');
        $products = $this->productModel->where(['status'=>1,'current_stock >'=>0])->findAll();
---
SELECT *
FROM `products`
WHERE `status` = 1
AND `current_stock` > 0