app/Helpers/common_helper.php

    function services() {
        $categoryModel = new CategoryModel();
        $services = $categoryModel->where(['is_active'=>1,'parent_id' =>0])->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
AND `parent_id` = 0