app/Controllers/frond/MyAccountController.php

    public function index()
    {
        $thisUser = session('user');
        $userData = $this->usersregistrationsModel->select('id,name,phone,email')->where('id', $thisUser['userId'])->get()->getRow();
        $recentOrders = $this->customerOrdersModel->select('customer_orders.*,COUNT(coi.id) as total_items')
        ->where('user_id', $thisUser['userId'])->orderBy('id', 'DESC')
        ->join('customer_orders_items as coi','coi.customer_order_id = customer_orders.id','left')
        ->groupBy('customer_orders.id')
        ->findAll(8);
        $orders = $this->customerOrdersModel->select('customer_orders.*,COUNT(coi.id) as total_items')
        ->where('user_id', $thisUser['userId'])->orderBy('id', 'DESC')
        ->join('customer_orders_items as coi','coi.customer_order_id = customer_orders.id','left')
        ->groupBy('customer_orders.id')
        ->findAll();
---
SELECT `name`, `phone`, `email`
FROM `usersregistrations`
WHERE `id` = '1'
SELECT `customer_orders`.*, COUNT(coi.id) as total_items
FROM `customer_orders`
LEFT JOIN `customer_orders_items` as `coi` ON `coi`.`customer_order_id` = `customer_orders`.`id`
WHERE `user_id` = '1'
GROUP BY `customer_orders`.`id`
ORDER BY `id` DESC
 LIMIT 8
SELECT `customer_orders`.*, COUNT(coi.id) as total_items
FROM `customer_orders`
LEFT JOIN `customer_orders_items` as `coi` ON `coi`.`customer_order_id` = `customer_orders`.`id`
WHERE `user_id` = '1'
GROUP BY `customer_orders`.`id`
ORDER BY `id` DESC

    public function changePassword() {
        $thisUser = session('user');
        $userId = $thisUser['userId'];
         $rules = [
            'currentPassword' => 'required',
            'newPassword' => 'required|min_length[6]',
            'confirmPassword' => 'required|matches[newPassword]',
        ];

        if(!$this->validate($rules)){
            return $this->response->setJSON([
                'success' => false,
                'errors' => $this->validator->getErrors(),
            ]);
        }

        $userModel = new UsersregistrationsModel();
        $user = $userModel->where('id', $userId)->get()->getRow();
        if(!password_verify($this->request->getPost('currentPassword'), $user->password)) {
            return $this->response->setJSON([
                'success' => false,
                'errors' => ['currentPassword' => 'Current password is incorrect'],
            ]);
        }

         $data = [
            'password' => password_hash($this->request->getPost('newPassword'), PASSWORD_DEFAULT),
        ];
        $userModel = new UsersregistrationsModel();
        if($userModel->update($userId,$data)) {
---
SELECT *
FROM `usersregistrations`
WHERE `id` = '1'
UPDATE `usersregistrations` SET `password` = '$2y$10$YxvXm.oX42rUKSsNalsnjutZ7wne7PmzlVwReZJto6tbQ.RZrXemm'
WHERE `usersregistrations`.`id` IN ('1')

    private function sendOrderMail($userId){
        $emailService = \Config\Services::email();
        $user = $this->usersregistrationsModel->where('id', $userId)->get()->getRow();
---
SELECT *
FROM `usersregistrations`
WHERE `id` = '1'