app/Controllers/CheckoutController.php

SELECT *
FROM `customer_orders`
WHERE `order_number` LIKE 'ORD-20260308%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1
---
    private function generateOrderNumber()
    {
        $prefix = 'ORD';
        $date = date('Ymd');

        $lastOrder = $this->customerOrderModel
            ->like('order_number', $prefix . '-' . $date, 'after')
            ->orderBy('id', 'DESC')
            ->first();

SELECT *
FROM `shipping_addresses`
WHERE `user_id` = '1'
AND `is_default` = 1
---
            //$db = \Config\Database::connect();
            //$db->transStart();
            //4 create order
            $address = $this->shippingAddressModel->where('user_id', $user['userId'])->where('is_default', 1)->get()->getRow();

INSERT INTO `customer_orders` (`user_id`, `order_number`, `tax`, `coupen_code_id`, `discount`, `address_id`, `sub_total`, `total_amount`, `payment_method`, `payment_status`, `status`, `created_at`) VALUES ('1', 'ORD-20260308-00004', 76, NULL, '0.00', '1', 505, 581, 'upi', 'pending', 'pending', '2026-03-08 10:15:41')
---

                    $orderData['gateway_order_id'] = $order['id'];

                    $order_id = $this->customerOrderModel->insert($orderData,true);