app/Models/ProductManageModel.php

    function getData($search='',$filter=false){
        $builder = $this->table('product_management');
        $builder->whereIn('product_status', [1,2]);
        if($search) {
            $builder->like('product_title', $search);
        }
        if($filter && $filter != 'all') {
            $builder->where('product_status', $filter);
        }
        return $builder->findAll();
---
SELECT *
FROM `product_management`
WHERE `product_status` IN (1,2)